**Pandas Tutorial**

Pandas provides numerous tools to work with tabular data like you'd find in spreadsheets or databases. It is widely used for data preparation, cleaning, and analysis. It can work with a wide variety of data and provides many visualization options. It is built on top of NumPy.

Imports

In [1]:
import numpy as np
import pandas as pd
from numpy import random

# Data Visualization
import seaborn as sns
import matplotlib.pyplot as plt

# **Series**

In [2]:
# Pandas uses something called a dataframe. It is a 2D data structure that can hold multiple data types.
# Columns have labels.

# Series are built on top of NumPy arrays. 
# Create a series by first creating a list
list_1 = ['a', 'b', 'c', 'd']
# I can define that I want the series indexes to be the
# provided labels
labels = [1, 2, 3, 4]
ser_1 = pd.Series(data=list_1, index=labels)
ser_1

1    a
2    b
3    c
4    d
dtype: object

In [3]:
# You can also add a NumPy array
arr_1 = np.array([1, 2, 3, 4])
arr_1

array([1, 2, 3, 4])

In [4]:
# Transform into series, it creates an index automatically
ser_2 = pd.Series(arr_1)
ser_2

0    1
1    2
2    3
3    4
dtype: int64

*Dictionary*

In [5]:
# You can quickly add labels and values with a dictionary
dict_1 = {"f_name": "Derek", "l_name": "Banas", "age": 44}
dict_1

{'f_name': 'Derek', 'l_name': 'Banas', 'age': 44}

In [6]:
ser_3 = pd.Series(dict_1)
ser_3

f_name    Derek
l_name    Banas
age          44
dtype: object

In [7]:
# Get data by label
ser_3['f_name']

'Derek'

In [8]:
# You can get the datatype
ser_1.dtype, ser_2.dtype, ser_3.dtype

(dtype('O'), dtype('int64'), dtype('O'))

## *Simple maths in Series*

In [9]:
# You can perform math operations on series
ser_2 + ser_2

0    2
1    4
2    6
3    8
dtype: int64

In [10]:
ser_2 - ser_2

0    0
1    0
2    0
3    0
dtype: int64

In [11]:
ser_2 * ser_2

0     1
1     4
2     9
3    16
dtype: int64

In [12]:
ser_2 / ser_2

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [13]:
np.exp(ser_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [14]:
# The difference between Series and ndarray is that operations
# align by labels

In [15]:
# Create a series from a dictionary
ser_4 = pd.Series({4: 5, 5: 6, 6: 7, 7: 8})
# If labels don't align you will get NaN
ser_2 + ser_4

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

In [16]:
# You can assign names to series
ser_5 = pd.Series({8: 9, 9: 10}, name='rand_nums')
ser_5

8     9
9    10
Name: rand_nums, dtype: int64

In [17]:
ser_5.name

'rand_nums'

# DataFrames

DataFrames are the most commonly used data structure with Pandas. They are made up of multiple series that share the same index / label. They can contain multiple data types. They can be created from dicts, series, lists or other dataframes.

https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

## Creating DataFrames

In [18]:
# Create random matrix 2x3 with values between 10 and 50
arr_2 = np.random.randint(10, 50, size=(2, 3))
arr_2

array([[34, 27, 45],
       [24, 12, 44]])

In [19]:
# Create DF with data, row labels & column labels
df_1 = pd.DataFrame(arr_2, index = ['A', 'B'], columns=['C', 'D', 'E'] )
df_1

    C   D   E
A  34  27  45
B  24  12  44

In [20]:
df_1A = pd.DataFrame(arr_2, index = ['A', 'B'], 
                    columns=['C', 'D', 'E'],dtype = 'float')
df_1A

      C     D     E
A  34.0  27.0  45.0
B  24.0  12.0  44.0

In [21]:
# Create a DF from multiple series in a dict
# If series are of different lengthes extra spaces are NaN
dict_3 = {'one': pd.Series([1., 2., 3.], index = ['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
dict_3

{'one': a    1.0
 b    2.0
 c    3.0
 dtype: float64,
 'two': a    1.0
 b    2.0
 c    3.0
 d    4.0
 dtype: float64}

In [22]:
df_2 = pd.DataFrame(dict_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [23]:
# from_dict accepts a column labels and lists
dict_exm = dict([('A', [1,2,3]), ('B', [4,5,6])])
dict_exm

{'A': [1, 2, 3], 'B': [4, 5, 6]}

In [24]:
pd.DataFrame.from_dict(dict_exm)

   A  B
0  1  4
1  2  5
2  3  6

In [25]:
# You can assign the keys as row labels and column labels separate
# with orient='index'
pd.DataFrame.from_dict(dict([('A',[1,2,3]), ('B', [4,5,5])]), orient = 'index',
                      columns = ['one', 'two', 'three'])

   one  two  three
A    1    2      3
B    4    5      5

In [26]:
# Get number of rows and columns as tuple
df_1.shape, df_2.shape

((2, 3), (4, 2))

In [27]:
# Multi Index DataFrames
df_mult_index = pd.DataFrame({"a" : [4, 5, 6],
                                "b" : [7, 8, 9],
                                "c" : [10, 11, 12]},
                               index = [1, 2, 3])
df_mult_index

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [28]:
df_mult_index_2 = pd.DataFrame({"a" : [4, 5, 6], "b" : [7, 8, 9],"c" : [10, 11, 12]},
                               index = pd.MultiIndex.from_tuples([('d', 1), 
                                                                  ('d', 2),
                                                                  ('e', 4)], 
                                                                 names=['n', 'v']))
df_mult_index_2

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 4  6  9  12

# Editing and Retrieving Data

In [29]:
print(df_1)

    C   D   E
A  34  27  45
B  24  12  44

In [30]:
# Grab a **column**
print(df_1['C']) # Use 1 ['x']
print('--------')
print(df_1[['C', 'E']]) # Use 2 [['x', 'y']]

A    34
B    24
Name: C, dtype: int64
--------
    C   E
A  34  45
B  24  44

In [31]:
# Grabb a row as a series
print(df_1.loc['A'])
print('--------')
# Grab row by index position
df_1.iloc[1]

C    34
D    27
E    45
Name: A, dtype: int64
--------

C    24
D    12
E    44
Name: B, dtype: int64

In [32]:
# Grab cell with Row & Column
df_1.loc['A', 'C']

34

In [33]:
# Grab multiple cells by defining rows wanted & the
# columns from those rows
df_1.loc[['A', 'B'], ['C', 'E']]

    C   E
A  34  45
B  24  44

In [34]:
# Make new column
df_1['Total'] = df_1['C'] + df_1['D'] + df_1['E']
df_1

    C   D   E  Total
A  34  27  45    106
B  24  12  44     80

In [35]:
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [36]:
# You can perform multiple calculations
df_2['mult'] = df_2['one'] * df_2['two']
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [37]:
# Make a new row by appending
dict_2 = {"C": 44, "D": 45, "E": 46}
new_row = pd.Series(dict_2, name = 'F')
df_1 = df_1.append(new_row)
df_1

      C     D     E  Total
A  34.0  27.0  45.0  106.0
B  24.0  12.0  44.0   80.0
F  44.0  45.0  46.0    NaN

In [38]:
# Delete column (axis = 1) and set inplace to True which is required
# because Pandas tries to help you not delete data by accident
df_1.drop('Total', axis=1, inplace=True)
df_1

      C     D     E
A  34.0  27.0  45.0
B  24.0  12.0  44.0
F  44.0  45.0  46.0

In [39]:
# Delete a row (axis=0) -- it doesn't need to add axis = 0!
df_1.drop('B', axis = 0, inplace=True)
df_1

      C     D     E
A  34.0  27.0  45.0
F  44.0  45.0  46.0

In [40]:
# Create a new column and make it the index
df_1['Sex'] = ['Men', 'Women']
df_1.set_index('Sex', inplace=True)
df_1

          C     D     E
Sex
Men    34.0  27.0  45.0
Women  44.0  45.0  46.0

In [41]:
# You can reset index values to numbers
df_1.reset_index(inplace=True)
df_1

     Sex     C     D     E
0    Men  34.0  27.0  45.0
1  Women  44.0  45.0  46.0

In [42]:
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [43]:
# Assign can be used to create a column while leaving the
# original DF untouched
df_2.assign(div=df_2['one'] / df_2['two'])
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [44]:
# You can pass in a function as well
df_2.assign(div=lambda x: (x['one'] / x['two']))
df_2

   one  two  mult
a  1.0  1.0   1.0
b  2.0  2.0   4.0
c  3.0  3.0   9.0
d  NaN  4.0   NaN

In [45]:
# Combine DataFrames while keeping df_3 data unless
# there is a NaN value

In [46]:
df_3 = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
df_3

     A
0  1.0
1  NaN
2  3.0
3  NaN

In [47]:
df_4 = pd.DataFrame({'A': [8., 9., 2., 4.]})
df_4

     A
0  8.0
1  9.0
2  2.0
3  4.0

In [48]:
df_3new = df_3.combine_first(df_4)
df_3new

     A
0  1.0
1  9.0
2  3.0
3  4.0

In [49]:
df_3 = pd.DataFrame({'A': [1., np.nan, 3., np.nan]})
df_4 = pd.DataFrame({'A': [8., 9., 2., 4.]})
df_3.combine_first(df_4)

     A
0  1.0
1  9.0
2  3.0
3  4.0

In [50]:
# Compare columns
df_3.compare(df_4)

     A
  self other
0  1.0   8.0
1  NaN   9.0
2  3.0   2.0
3  NaN   4.0

In [51]:
# Combine, using a function
df1 = pd.DataFrame({'A': [5, 0], 'B': [2, 4]})
print(df1)
print('--------')
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})
print(df2)
print('--------')
df1.combine(df2, np.minimum)

   A  B
0  5  2
1  0  4
--------
   A  B
0  1  3
1  1  3
--------

   A  B
0  1  2
1  0  3

# Vector Functions

pandas provides a large set of vector functions that operate on all
columns of a DataFrame or a single selected column (a pandas
Series). These functions produce vectors of values for each of the
columns, or a single Series for the individual Series. Examples:

In [52]:
df_test = pd.DataFrame({'Length': pd.Series([1., 4., 3., 2.]),
                        'Height': pd.Series([1., 4., 3., 2.]),
                        'Depth': pd.Series([1., 4., 3., 2.])})
df_test

   Length  Height  Depth
0     1.0     1.0    1.0
1     4.0     4.0    4.0
2     3.0     3.0    3.0
3     2.0     2.0    2.0

In [53]:
# Compute and append one or more new columns.
df_test.assign(Area=lambda df_test: df_test.Length*df_test.Height)

   Length  Height  Depth  Area
0     1.0     1.0    1.0   1.0
1     4.0     4.0    4.0  16.0
2     3.0     3.0    3.0   9.0
3     2.0     2.0    2.0   4.0

In [54]:
# Add single column.
df_test['Volume'] = df_test.Length*df_test.Height*df_test.Depth
df_test

   Length  Height  Depth  Volume
0     1.0     1.0    1.0     1.0
1     4.0     4.0    4.0    64.0
2     3.0     3.0    3.0    27.0
3     2.0     2.0    2.0     8.0

In [55]:
# Bin column into n buckets.
# pd.qcut(df.col, n, labels=False)
pd.qcut(df_test['Volume'], 2, labels=['low', 'high'])

0     low
1    high
2    high
3     low
Name: Volume, dtype: category
Categories (2, object): ['low' < 'high']

In [56]:
df_test['Volume_bucket'] = pd.qcut(df_test['Volume'], 2, labels=['low', 'high'])
df_test

   Length  Height  Depth  Volume Volume_bucket
0     1.0     1.0    1.0     1.0           low
1     4.0     4.0    4.0    64.0          high
2     3.0     3.0    3.0    27.0          high
3     2.0     2.0    2.0     8.0           low

In [57]:
# Element-wise max. Column max > axis =1 
df_test.max(axis=1)

/var/folders/s2/rxgrts2d0x3cngcs6yc5fmr40000gn/T/ipykernel_88253/2487583419.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_test.max(axis=1)

0     1.0
1    64.0
2    27.0
3     8.0
dtype: float64

In [58]:
# Element-wise min. Row min > axis = 0
df_test.min(axis = 0)

Length           1.0
Height           1.0
Depth            1.0
Volume           1.0
Volume_bucket    low
dtype: object

In [59]:
# Trim values at input thresholds
df_test['Volume_thersholds'] = df_test['Volume'].clip(lower=-10,upper=10)
df_test

   Length  Height  Depth  Volume Volume_bucket  Volume_thersholds
0     1.0     1.0    1.0     1.0           low                1.0
1     4.0     4.0    4.0    64.0          high               10.0
2     3.0     3.0    3.0    27.0          high               10.0
3     2.0     2.0    2.0     8.0           low                8.0

# Conditional Selection

In [60]:
# Dataset start: Matrix 2x3 using random numbers from 10 to 50
arr_2 = np.random.randint(10, 50, size=(2, 3))
arr_2

array([[22, 15, 22],
       [10, 43, 29]])

In [61]:
df_1 = pd.DataFrame(arr_2, ['A', 'B'], ['C', 'D', 'E'])
print(df_1)

    C   D   E
A  22  15  22
B  10  43  29

In [62]:
# You can use conditional operators to retrieve a table
# based on the condition
print("Greater than 40\n", df_1 > 40.0)

Greater than 40
        C      D      E
A  False  False  False
B  False   True  False

In [63]:
# You can use comparison operater functions as well like
# gt (greater than), ge (Greater than or equal),
# lt (lower than), le (Lower than or equal) , 
# eq (Equal to), ne (not equal to)
print("Greater than 45\n", df_1.gt(45.0))

Greater than 45
        C      D      E
A  False  False  False
B  False  False  False

In [64]:
print("Lower than 45\n", df_1.lt(45.0))

Lower than 45
       C     D     E
A  True  True  True
B  True  True  True

In [65]:
print("Greater than 49\n", df_1.ge(49.0))

Greater than 49
        C      D      E
A  False  False  False
B  False  False  False

In [66]:
print("Equal to 38\n", df_1.eq(38.0))

Equal to 38
        C      D      E
A  False  False  False
B  False  False  False

In [67]:
print("Not equal to 38\n", df_1.ne(38.0))

Not equal to 38
       C     D     E
A  True  True  True
B  True  True  True

In [68]:
# You can place conditions in brackets as well
bool_1 = df_1 >= 45.0
df_1[bool_1]

    C   D   E
A NaN NaN NaN
B NaN NaN NaN

In [69]:
# Get bools for a column
df_1['E'] > 40

A    False
B    False
Name: E, dtype: bool

In [70]:
# Return a row if cell value in column matches a condition
df_1[df_1['E']>30]

Empty DataFrame
Columns: [C, D, E]
Index: []

In [71]:
# You can focus on a column based on resulting dataframe
df_2 = df_1[df_1['E']>30]
df_2['C']

Series([], Name: C, dtype: int64)

In [72]:
# You can stack these commands
print(df_1[df_1['E']>20]['C'])
print()

A    22
B    10
Name: C, dtype: int64

In [73]:
# You can also grab multiple columns
print(df_1[df_1['E']>20][['C', 'D']])

    C   D
A  22  15
B  10  43

In [74]:
# You can use multiple conditions
arr_3 = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df_2 = pd.DataFrame(arr_3, index = ['A', 'B', 'C'], columns= ['X', 'Y', 'Z'])
print(df_2, "\n")

   X  Y  Z
A  1  2  3
B  4  5  6
C  7  8  9

In [75]:
# You can use or | to combine conditions as well
df_2[(df_2['X']>3) & (df_2['X']<7)]

   X  Y  Z
B  4  5  6

# File Input / Output

Pandas can work with the following types of data : CSV, Plain Text, JSON, XML, PDF, SQL, HTML, XLSX, DOCX, ZIP, Images Hierarchical Data Format, MP3, and MP4.

In [76]:
# Read a CSV file
# Type pd.read_ [TAB] to see the file types you can read
pb_df = pd.read_csv('../raw_data/phone_book.csv')
pb_df

  first_name  last_name  phone_number
0       John     Lennon           123
1     George  Harrisson           456
2      Ringo      Starr           789

In [77]:
spotify_df = pd.read_csv('../raw_data/spotify_2017.csv')

## Subset Observations - rows

In [78]:
# Get info of dataset
spotify_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                100 non-null    object
 1   name              100 non-null    object
 2   artists           100 non-null    object
 3   danceability      100 non-null    float64
 4   energy            100 non-null    float64
 5   key               100 non-null    float64
 6   loudness          100 non-null    float64
 7   mode              100 non-null    float64
 8   speechiness       100 non-null    float64
 9   acousticness      100 non-null    float64
 10  instrumentalness  100 non-null    float64
 11  liveness          100 non-null    float64
 12  valence           100 non-null    float64
 13  tempo             100 non-null    float64
 14  duration_ms       100 non-null    float64
 15  time_signature    100 non-null    float64
dtypes: float64(13), object(3)
memory usage: 12.6+ KB

In [79]:
spotify_df.shape

(100, 16)

In [80]:
# Display 1st 5 rows
spotify_df.head()

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
0,7qiZfU4dY1lWllzX7mPBI,Shape of You,Ed Sheeran,0.825,0.652,1.0,-3.183,0.0,0.0802,0.5810,0.000000,0.0931,0.931,95.977,233713.0,4.0
1,5CtI0qwDJkDQGwXD1H1cL,Despacito - Remix,Luis Fonsi,0.694,0.815,2.0,-4.328,1.0,0.1200,0.2290,0.000000,0.0924,0.813,88.931,228827.0,4.0
2,4aWmUDTfIPGksMNLV2rQP,Despacito (Featuring Daddy Yankee),Luis Fonsi,0.660,0.786,2.0,-4.757,1.0,0.1700,0.2090,0.000000,0.1120,0.846,177.833,228200.0,4.0
3,6RUKPb4LETWmmr3iAEQkt,Something Just Like This,The Chainsmokers,0.617,0.635,11.0,-6.769,0.0,0.0317,0.0498,0.000014,0.1640,0.446,103.019,247160.0,4.0
4,3DXncPQOG4VBw3QHh3S81,I'm the One,DJ Khaled,0.609,0.668,7.0,-4.284,1.0,0.0367,0.0552,0.000000,0.1670,0.811,80.924,288600.0,4.0

In [81]:
# Display last 5 rows
spotify_df.tail()

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
95,1PSBzsahR2AKwLJgx8ehB,Bad Things (with Camila Cabello),Machine Gun Kelly,0.675,0.690,2.0,-4.761,1.0,0.1320,0.210,0.000000,0.287,0.2720,137.817,239293.0,4.0
96,0QsvXIfqM0zZoerQfsI9l,Don't Let Me Down,The Chainsmokers,0.542,0.859,11.0,-5.651,1.0,0.1970,0.160,0.004660,0.137,0.4030,159.797,208053.0,4.0
97,7mldq42yDuxiUNn08nvzH,Body Like A Back Road,Sam Hunt,0.731,0.469,5.0,-7.226,1.0,0.0326,0.463,0.000001,0.103,0.6310,98.963,165387.0,4.0
98,7i2DJ88J7jQ8K7zqFX2fW,Now Or Never,Halsey,0.658,0.588,6.0,-4.902,0.0,0.0367,0.105,0.000001,0.125,0.4340,110.075,214802.0,4.0
99,1j4kHkkpqZRBwE0A4CN4Y,Dusk Till Dawn - Radio Edit,ZAYN,0.258,0.437,11.0,-6.593,0.0,0.0390,0.101,0.000001,0.106,0.0967,180.043,239000.0,4.0

In [82]:
# Get 1st 2 rows
spotify_df[:2]

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
0,7qiZfU4dY1lWllzX7mPBI,Shape of You,Ed Sheeran,0.825,0.652,1.0,-3.183,0.0,0.0802,0.581,0.0,0.0931,0.931,95.977,233713.0,4.0
1,5CtI0qwDJkDQGwXD1H1cL,Despacito - Remix,Luis Fonsi,0.694,0.815,2.0,-4.328,1.0,0.1200,0.229,0.0,0.0924,0.813,88.931,228827.0,4.0

In [83]:
# Get 1st through 5 with a 2 step
spotify_df[:5:2]

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
0,7qiZfU4dY1lWllzX7mPBI,Shape of You,Ed Sheeran,0.825,0.652,1.0,-3.183,0.0,0.0802,0.5810,0.0,0.0931,0.931,95.977,233713.0,4.0
2,4aWmUDTfIPGksMNLV2rQP,Despacito (Featuring Daddy Yankee),Luis Fonsi,0.660,0.786,2.0,-4.757,1.0,0.1700,0.2090,0.0,0.1120,0.846,177.833,228200.0,4.0
4,3DXncPQOG4VBw3QHh3S81,I'm the One,DJ Khaled,0.609,0.668,7.0,-4.284,1.0,0.0367,0.0552,0.0,0.1670,0.811,80.924,288600.0,4.0

In [84]:
# Get indexes
spotify_df.index.array

<PandasArray>
[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37,
 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56,
 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75,
 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94,
 95, 96, 97, 98, 99]
Length: 100, dtype: int64

In [85]:
# Get NumPy array
spotify_df['name'].to_numpy()

array(['Shape of You', 'Despacito - Remix',
       'Despacito (Featuring Daddy Yankee)', 'Something Just Like This',
       "I'm the One", 'HUMBLE.', "It Ain't Me (with Selena Gomez)",
       'Unforgettable', "That's What I Like",
       'I Dont Wanna Live Forever (Fifty Shades Darker) - From "Fifty Shades Darker (Original Motion Picture Soundtrack)"',
       'XO TOUR Llif3', 'Paris', 'Stay (with Alessia Cara)', 'Attention',
       'Mask Off', 'Congratulations',
       'Swalla (feat. Nicki Minaj & Ty Dolla $ign)', 'Castle on the Hill',
       'Rockabye (feat. Sean Paul & Anne-Marie)', 'Believer', 'Mi Gente',
       'Thunder', "Say You Won't Let Go",
       "There's Nothing Holdin' Me Back", 'Me Rehso', 'Issues',
       'Galway Girl', 'Scared to Be Lonely', 'Closer',
       'Symphony (feat. Zara Larsson)', 'I Feel It Coming', 'Starboy',
       'Wild Thoughts', 'Slide', 'New Rules', '1-800-273-8255',
       'Passionfruit', 'rockstar', 'Strip That Down',
       '2U (feat. Justin Bieber)', 'Perfect',
       'Call On Me - Ryan Riback Extended Remix', 'Feels', 'Mama',
       'Felices los 4', 'iSpy (feat. Lil Yachty)', 'Location', 'Chantaje',
       'Bad and Boujee (feat. Lil Uzi Vert)', 'Havana', 'Solo Dance',
       'Fake Love', 'Let Me Love You', 'More Than You Know', 'One Dance',
       'SUBEME LA RADIO', 'Pretty Girl - Cheat Codes X CADE Remix',
       'Sorry Not Sorry', 'Redbone', '24K Magic', 'DNA.', 'El Amante',
       "You Don't Know Me - Radio Edit", 'Chained To The Rhythm',
       'No Promises (feat. Demi Lovato)',
       "Don't Wanna Know (feat. Kendrick Lamar)",
       'How Far I\'ll Go - From "Moana"', 'Slow Hands',
       'Escpate Conmigo', 'Bounce Back', 'Sign of the Times',
       'goosebumps', 'Young Dumb & Broke', 'There for You',
       'Cold (feat. Future)', 'Silence', 'Too Good At Goodbyes',
       'Just Hold On', 'Look What You Made Me Do',
       'Glorious (feat. Skylar Grey)', 'Starving',
       'Reggaetn Lento (Bailemos)', 'Weak', 'Side To Side',
       'Otra Vez (feat. J Balvin)', 'I Like Me Better',
       'In the Name of Love', 'Cold Water (feat. Justin Bieber & M)',
       'Malibu', 'All Night', 'Hear Me Now', 'Your Song', 'Ahora Dice',
       'Friends (with BloodPop)', 'Bank Account',
       'Bad Things (with Camila Cabello)', "Don't Let Me Down",
       'Body Like A Back Road', 'Now Or Never',
       'Dusk Till Dawn - Radio Edit'], dtype=object)

In [86]:
# Randomly select fraction of rows. 
spotify_df.sample(frac=0.1)

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
41,78rIJddV4X0HkNAInEcYd,Call On Me - Ryan Riback Extended Remix,Starley,0.676,0.843,0.0,-4.068,1.0,0.0367,0.062300,0.000752,0.1810,0.718,105.003,222041.0,4.0
95,1PSBzsahR2AKwLJgx8ehB,Bad Things (with Camila Cabello),Machine Gun Kelly,0.675,0.690,2.0,-4.761,1.0,0.1320,0.210000,0.000000,0.2870,0.272,137.817,239293.0,4.0
5,7KXjTSCq5nL1LoYtL7XAw,HUMBLE.,Kendrick Lamar,0.904,0.611,1.0,-6.842,0.0,0.0888,0.000259,0.000020,0.0976,0.400,150.020,177000.0,4.0
13,4iLqG9SeJSnt0cSPICSjx,Attention,Charlie Puth,0.774,0.626,3.0,-4.432,0.0,0.0432,0.096900,0.000031,0.0848,0.777,100.041,211475.0,4.0
20,2rb5MvYT7ZIxbKW5hfcHx,Mi Gente,J Balvin,0.543,0.677,11.0,-4.915,0.0,0.0993,0.014800,0.000006,0.1300,0.294,103.809,189440.0,4.0
73,6jA8HL9i4QGzsj6fjoxp8,There for You,Martin Garrix,0.611,0.644,6.0,-7.607,0.0,0.0553,0.124000,0.000000,0.1240,0.130,105.969,221904.0,4.0
23,79cuOz3SPQTuFrp8WgftA,There's Nothing Holdin' Me Back,Shawn Mendes,0.857,0.800,2.0,-4.035,1.0,0.0583,0.381000,0.000000,0.0913,0.966,121.996,199440.0,4.0
45,2EEeOnHehOozLq4aS0n6S,iSpy (feat. Lil Yachty),KYLE,0.746,0.653,7.0,-6.745,1.0,0.2890,0.378000,0.000000,0.2290,0.672,75.016,253107.0,4.0
40,0tgVpDi06FyKpA1z0VMD4,Perfect,Ed Sheeran,0.599,0.448,8.0,-6.312,1.0,0.0232,0.163000,0.000000,0.1060,0.168,95.050,263400.0,3.0
82,3E2Zh20GDCR9B1EYjfXWy,Weak,AJR,0.673,0.637,5.0,-4.518,1.0,0.0429,0.137000,0.000000,0.1840,0.678,123.980,201160.0,4.0

In [87]:
# Randomly select n rows.
spotify_df.sample(n=8)

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
73,6jA8HL9i4QGzsj6fjoxp8,There for You,Martin Garrix,0.611,0.644,6.0,-7.607,0.0,0.0553,0.1240,0.000000,0.1240,0.130,105.969,221904.0,4.0
87,6DNtNfH8hXkqOX1sjqmI7,Cold Water (feat. Justin Bieber & M),Major Lazer,0.608,0.798,6.0,-5.092,0.0,0.0432,0.0736,0.000000,0.1560,0.501,92.943,185352.0,4.0
6,3eR23VReFzcdmS7TYCrhC,It Ain't Me (with Selena Gomez),Kygo,0.640,0.533,0.0,-6.596,1.0,0.0706,0.1190,0.000000,0.0864,0.515,99.968,220781.0,4.0
58,3kxfsdsCpFgN412fpnW85,Redbone,Childish Gambino,0.743,0.359,1.0,-10.401,1.0,0.0794,0.1990,0.006110,0.1370,0.587,160.083,326933.0,4.0
22,5uCax9HTNlzGybIStD3vD,Say You Won't Let Go,James Arthur,0.358,0.557,10.0,-7.398,1.0,0.0590,0.6950,0.000000,0.0902,0.494,85.043,211467.0,4.0
62,00lNx0OcTJrS3MKHcB80H,You Don't Know Me - Radio Edit,Jax Jones,0.876,0.669,11.0,-6.054,0.0,0.1380,0.1630,0.000000,0.1850,0.682,124.007,213947.0,4.0
67,38yBBH2jacvDxrznF7h08,Slow Hands,Niall Horan,0.734,0.418,0.0,-6.678,1.0,0.0425,0.0129,0.000000,0.0579,0.868,85.909,188174.0,4.0
17,6PCUP3dWmTjcTtXY02oFd,Castle on the Hill,Ed Sheeran,0.461,0.834,2.0,-4.868,1.0,0.0989,0.0232,0.000011,0.1400,0.471,135.007,261154.0,4.0

In [88]:
# Select and order top n entries.
spotify_df.nlargest(2, 'energy')

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
77,3EmmCZoqpWOTY1g2GBwJo,Just Hold On,Steve Aoki,0.647,0.932,11.0,-3.515,1.0,0.0824,0.00383,0.000002,0.0574,0.374,114.991,198774.0,4.0
26,0afhq8XCExXpqazXczTSv,Galway Girl,Ed Sheeran,0.624,0.876,9.0,-3.374,1.0,0.1000,0.07350,0.000000,0.3270,0.781,99.943,170827.0,4.0

In [89]:
# Select and order bottom n entries.
spotify_df.nsmallest(2, 'energy')

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
94,2fQrGHiQOvpL9UgPvtYy6,Bank Account,21 Savage,0.884,0.346,8.0,-8.228,0.0,0.3510,0.0151,0.000007,0.0871,0.376,75.016,220307.0,4.0
58,3kxfsdsCpFgN412fpnW85,Redbone,Childish Gambino,0.743,0.359,1.0,-10.401,1.0,0.0794,0.1990,0.006110,0.1370,0.587,160.083,326933.0,4.0

## Subset Variables - columns

In [90]:
# Select single column with specific name.
spotify_df['name']

0                           Shape of You
1                      Despacito - Remix
2     Despacito (Featuring Daddy Yankee)
3               Something Just Like This
4                            I'm the One
                     ...
95      Bad Things (with Camila Cabello)
96                     Don't Let Me Down
97                 Body Like A Back Road
98                          Now Or Never
99           Dusk Till Dawn - Radio Edit
Name: name, Length: 100, dtype: object

In [91]:
# Select multiple columns with specific names.
spotify_df[['name','artists']]

                                  name            artists
0                         Shape of You         Ed Sheeran
1                    Despacito - Remix         Luis Fonsi
2   Despacito (Featuring Daddy Yankee)         Luis Fonsi
3             Something Just Like This   The Chainsmokers
4                          I'm the One          DJ Khaled
..                                 ...                ...
95    Bad Things (with Camila Cabello)  Machine Gun Kelly
96                   Don't Let Me Down   The Chainsmokers
97               Body Like A Back Road           Sam Hunt
98                        Now Or Never             Halsey
99         Dusk Till Dawn - Radio Edit               ZAYN

[100 rows x 2 columns]

In [92]:
# Select columns whose name matches regular expression regex.
spotify_df.filter(regex = 'e$', axis = 1)

                                  name  mode  valence  time_signature
0                         Shape of You   0.0   0.9310             4.0
1                    Despacito - Remix   1.0   0.8130             4.0
2   Despacito (Featuring Daddy Yankee)   1.0   0.8460             4.0
3             Something Just Like This   0.0   0.4460             4.0
4                          I'm the One   1.0   0.8110             4.0
..                                 ...   ...      ...             ...
95    Bad Things (with Camila Cabello)   1.0   0.2720             4.0
96                   Don't Let Me Down   1.0   0.4030             4.0
97               Body Like A Back Road   1.0   0.6310             4.0
98                        Now Or Never   0.0   0.4340             4.0
99         Dusk Till Dawn - Radio Edit   0.0   0.0967             4.0

[100 rows x 4 columns]

In [93]:
# Filter a string name
spotify_df[spotify_df['artists'].str.contains('Luis Fonsi')]

,id,name,artists,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,tempo,duration_ms,time_signature
1,5CtI0qwDJkDQGwXD1H1cL,Despacito - Remix,Luis Fonsi,0.694,0.815,2.0,-4.328,1.0,0.12,0.229,0.0,0.0924,0.813,88.931,228827.0,4.0
2,4aWmUDTfIPGksMNLV2rQP,Despacito (Featuring Daddy Yankee),Luis Fonsi,0.660,0.786,2.0,-4.757,1.0,0.17,0.209,0.0,0.1120,0.846,177.833,228200.0,4.0

# Basics & Math

In [94]:
dict_3 = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
         'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
df_2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [95]:
# You can replace NaN values with 0 or anything else
print(df_2.fillna(0))

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  0.0  4.0

In [96]:
# Get values in row 2
row = df_2.iloc[1]
row

one    2.0
two    2.0
Name: b, dtype: float64

In [97]:
# You can do the same with sub, mul, and div
df_2.add(row, axis='columns')

   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  NaN  6.0

In [98]:
# Get column 2
col = df_2['two']
# Subtract from other columns
df_2.sub(col, axis=0)

   one  two
a  0.0  0.0
b  0.0  0.0
c  0.0  0.0
d  NaN  0.0

In [99]:
# Check if empty
df_2.empty

False

In [100]:
# Transform executes a function on a dataframe
df_5 = pd.DataFrame({'A': range(3), 'B': range(1, 4)})
df_5

   A  B
0  0  1
1  1  2
2  2  3

In [101]:
df_5.transform(lambda x: x+1)

   A  B
0  1  2
1  2  3
2  3  4

In [102]:
df_5.transform(lambda x: x**2)

   A  B
0  0  1
1  1  4
2  4  9

In [103]:
df_5.transform(lambda x: np.sqrt(x))

          A         B
0  0.000000  1.000000
1  1.000000  1.414214
2  1.414214  1.732051

In [104]:
# Passing a dictionary allows you to perform different calculations
# on different columns
df_5.transform({'A': lambda x: x+10, 'B': lambda x: x**3})

    A   B
0  10   1
1  11   8
2  12  27

In [105]:
# map performs a function on a series
df_5['A'].map(lambda x: x**2)

0    0
1    1
2    4
Name: A, dtype: int64

In [106]:
# applymap does the same on a dataframe
df_5.applymap(lambda x: x**2)

   A  B
0  0  1
1  1  4
2  4  9

In [107]:
# Get unique values in column 2 of DF
df_2['two'].unique()

array([1., 2., 3., 4.])

In [108]:
# Get number of uniques
df_2['two'].nunique()

4

In [109]:
# Get the number of times each value showed in column 2
df_2['two'].value_counts()

1.0    1
2.0    1
3.0    1
4.0    1
Name: two, dtype: int64

In [110]:
# Get column names
df_2.columns

Index(['one', 'two'], dtype='object')

In [111]:
# Get index info
df_2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [112]:
# Return a DF that lists null values as True
df_2.isnull()

     one    two
a  False  False
b  False  False
c  False  False
d   True  False

# Group Data

In [113]:
# Groupby allows you to group rows based on a column and perform a function
# that combines those values (Aggregate Function)
dict_5 = {'Store': [1,2,1,2], 'Flavor': ['Choc', 'Van', 'Straw', 'Choc'], 
         'Sales': [26, 12, 18, 22]}
dict_5

{'Store': [1, 2, 1, 2],
 'Flavor': ['Choc', 'Van', 'Straw', 'Choc'],
 'Sales': [26, 12, 18, 22]}

In [114]:
df_11 = pd.DataFrame(dict_5)
df_11

   Store Flavor  Sales
0      1   Choc     26
1      2    Van     12
2      1  Straw     18
3      2   Choc     22

In [115]:
# Group data by the store number
by_store = df_11.groupby('Store')
by_store

In [116]:
# Get mean sales by store
by_store.mean()

       Sales
Store
1       22.0
2       17.0

In [117]:
# Get sales total just for store 1
by_store.sum().loc[1]

Sales    44
Name: 1, dtype: int64

In [118]:
# You can use multiple functions of get a bunch
by_store.describe()

      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

In [119]:
by_store2 = df_11.groupby('Store').count()['Flavor']
by_store2

Store
1    2
2    2
Name: Flavor, dtype: int64

In [120]:
# Copy with values shifted by 1.
df_11.shift(1)

   Store Flavor  Sales
0    NaN    NaN    NaN
1    1.0   Choc   26.0
2    2.0    Van   12.0
3    1.0  Straw   18.0

In [121]:
df_11.shift(-1)

   Store Flavor  Sales
0    2.0    Van   12.0
1    1.0  Straw   18.0
2    2.0   Choc   22.0
3    NaN    NaN    NaN

In [122]:
df_11['Sales'].rank(method='first')

0    4.0
1    1.0
2    2.0
3    3.0
Name: Sales, dtype: float64

In [123]:
df_11['Sales'].cumsum()

0    26
1    38
2    56
3    78
Name: Sales, dtype: int64

# Concatenate Merge & Join Data

In [124]:
# You can concatenate DFs in the order DFs are provided
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6]},
                    index=[1,2,3])
df_12

   A  B
1  1  4
2  2  5
3  3  6

In [125]:
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12]},
                    index=[4,5,6])
df_13

   A   B
4  7  10
5  8  11
6  9  12

In [126]:
df_12.combine(df_13, np.minimum)

    A   B
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN
5 NaN NaN
6 NaN NaN

In [127]:
# Append rows of DataFrames
pd.concat([df_12, df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [128]:
# Append columns of DataFrames
pd.concat([df_12, df_13], axis =1)

     A    B    A     B
1  1.0  4.0  NaN   NaN
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  7.0  10.0
5  NaN  NaN  8.0  11.0
6  NaN  NaN  9.0  12.0

In [129]:
df_12 = pd.DataFrame({'A': [1,2,3],
                     'B': [4,5,6],
                     'key': [1,2,3]})
df_12

   A  B  key
0  1  4    1
1  2  5    2
2  3  6    3

In [130]:
df_13 = pd.DataFrame({'A': [7,8,9],
                     'B': [10,11,12],
                     'key': [1,2,3]})
df_13

   A   B  key
0  7  10    1
1  8  11    2
2  9  12    3

In [131]:
# inner merges at the intersection of keys
# how='inner'
# how='left' or 'right' : Use keys from left or right frame
# how='outer' : Use union of keys
pd.merge(df_12, df_13, how = 'inner', on = 'key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [132]:
adf = pd.DataFrame({'x1': ['A', 'B','C'],
                     'x2': [1,2,3]})
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [133]:
bdf = pd.DataFrame({'x1': ['A', 'B','D'],
                     'x3': ['T','F','T']})
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [134]:
# Join matching rows from bdf to adf.
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [135]:
# Join matching rows from adf to bdf.
pd.merge(adf, bdf,how='right', on='x1')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [136]:
# Join data. Retain only rows in both sets.
pd.merge(adf, bdf,how='inner', on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [137]:
# Join data. Retain all values, all rows.
pd.merge(adf, bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

## Filtering Joins

In [138]:
# All rows in adf that have a match in bdf.
adf[adf.x1.isin(bdf.x1)]

  x1  x2
0  A   1
1  B   2

In [139]:
# All rows in adf that do not have a match in bdf
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3

## Set-like Operations

In [140]:
ydf = pd.DataFrame({'x1': ['A', 'B','C'],
                     'x2': [1,2,3]})
ydf

  x1  x2
0  A   1
1  B   2
2  C   3

In [141]:
zdf = pd.DataFrame({'x1': ['B', 'C','D'],
                     'x2': [2,3,4]})
zdf

  x1  x2
0  B   2
1  C   3
2  D   4

In [142]:
# Rows that appear in both ydf and zdf (Intersection).
pd.merge(ydf, zdf)

  x1  x2
0  B   2
1  C   3

In [143]:
# Rows that appear in either or both ydf and zdf (Union).
pd.merge(ydf, zdf, how='outer')

  x1  x2
0  A   1
1  B   2
2  C   3
3  D   4

In [144]:
# Rows that appear in ydf but not zdf (Setdiff).
pd.merge(ydf, zdf, how='outer', indicator=True)

  x1  x2      _merge
0  A   1   left_only
1  B   2        both
2  C   3        both
3  D   4  right_only

In [145]:
pd.merge(ydf, zdf, how='outer', indicator=True).query('_merge == "left_only"')

  x1  x2     _merge
0  A   1  left_only

In [146]:
pd.merge(ydf, zdf, how='outer', 
         indicator=True).query('_merge == "left_only"').drop(columns=['_merge'])

  x1  x2
0  A   1

# Statistics

In [147]:
ics_df = pd.read_csv('../raw_data/icecream_sales.csv')

In [148]:
ics_df.head()

       date  sales
0  1/1/2019  59.96
1  1/2/2019  67.06
2  1/3/2019  74.24
3  1/4/2019  78.11
4  1/5/2019  84.76

In [149]:
# Get total count of both columns
ics_df.count()

date     365
sales    365
dtype: int64

In [150]:
# skipna skips null / NaN values
ics_df.sum(skipna=True)

date     1/1/20191/2/20191/3/20191/4/20191/5/20191/6/20...
sales                                             38142.32
dtype: object

In [151]:
# Get statistics for named column
print(f'Sales mean: {ics_df["sales"].mean()}')
print(f'Sales median: {ics_df["sales"].median()}')
print(f'Sales mode:\n {ics_df["sales"].mode()}')
print(f'Sales min: {ics_df["sales"].min()}')
print(f'Sales max: {ics_df["sales"].max()}')
print(f'Sales prod: {ics_df["sales"].prod()}') # Product of values
print(f'Sales std: {ics_df["sales"].std()}') # Standard deviation
print(f'Sales var: {ics_df["sales"].var()}') # Variance
print(f'Sales std error: {ics_df["sales"].sem()}') # Standard error

Sales mean: 104.49950684931507
Sales median: 102.07
Sales mode:
 0     86.61
1    106.41
2    106.93
3    114.72
4    137.55
dtype: float64
Sales min: 58.66
Sales max: 184.11
Sales prod: inf
Sales std: 26.942417398048004
Sales var: 725.8938552506398
Sales std error: 1.4102305798549106

In [152]:
# Negative : Left long tail, Positive : Right long tail
ics_df["sales"].skew()

0.41456467408401054

In [153]:
# Kurtosis : < 3 less outliers, 3 Normal Distribution,
# > 3 more outliers
ics_df["sales"].kurt()

-0.4799472596770893

In [154]:
# Other statistics functions
# ics_df["sales"].quantile(.5)
# ics_df["sales"].cumsum()
# ics_df["sales"].cumprod()
# ics_df["sales"].cummax()
# ics_df["sales"].cummin()

In [155]:
# Multiple stats at once
ics_df.describe()

            sales
count  365.000000
mean   104.499507
std     26.942417
min     58.660000
25%     85.270000
50%    102.070000
75%    123.040000
max    184.110000

In [156]:
# Value counts
ser_dice = pd.Series(data=[2, 3, 3, 4, 4, 4, 5, 5, 5, 5, 6, 6, 
                           6, 6, 6, 7, 7, 7, 7, 7, 7, 8, 8, 8,
                          8, 8, 9, 9, 9, 9, 10, 10, 10, 11, 11, 12])
# Count for each value in series
ser_dice.value_counts().sort_index()

2     1
3     2
4     3
5     4
6     5
7     6
8     5
9     4
10    3
11    2
12    1
dtype: int64

In [157]:
# You can perform calculations on multiple columns using
# aggregate
print(df_2)
df_2.agg(np.mean)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

one    2.0
two    2.5
dtype: float64

In [158]:
# You can do this with multiple functions
df_2.agg(['mean', 'std'])

      one       two
mean  2.0  2.500000
std   1.0  1.290994

# Iteration

In [159]:
# Iterating over series
ser_7 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
ser_7

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [161]:
for col in ser_7:
    print(col)
print()

0
1
2
3
4

In [162]:
# Iterating over DFs
arr_4 = np.random.randint(10, 50, size=(2, 3))
df_8 = pd.DataFrame(arr_4, ['B', 'C'], ['C', 'D', 'E'])
print(df_8)

    C   D   E
B  47  20  44
C  30  49  10

In [163]:
# items allows you to iterate through key value pairs to make
# calculations 1 column at a time
for label, ser in df_8.items():
    print(label)
    print(ser)
    
print()

C
B    47
C    30
Name: C, dtype: int64
D
B    20
C    49
Name: D, dtype: int64
E
B    44
C    10
Name: E, dtype: int64

In [164]:
# You can also iterate through rows
for index, row in df_8.iterrows():
    print(f"{index}\n{row}")
print()

B
C    47
D    20
E    44
Name: B, dtype: int64
C
C    30
D    49
E    10
Name: C, dtype: int64

In [165]:
# Get a tuple that contains row data
for row in df_8.itertuples():
    print(row)

Pandas(Index='B', C=47, D=20, E=44)
Pandas(Index='C', C=30, D=49, E=10)

# Sorting

In [166]:
# Sorting by index will return the same results if indexes
# are in order, to reverse indexes mark ascending as False
df_8.sort_index(ascending=False)

    C   D   E
C  30  49  10
B  47  20  44

In [168]:
# Sort by value for column D (Use the same function for series)
df_8.sort_values(by='E')

    C   D   E
C  30  49  10
B  47  20  44

# Passing Data to Functions

In [170]:
import sys

# You can pass DataFrames and Series into functions
def get_profit_total(df):
    prof_ser = df['sales']
    print(f"Total sales : {prof_ser.sum()}")

get_profit_total(ics_df)

Total sales : 38142.32

In [171]:
pb_df.head()

  first_name  last_name  phone_number
0       John     Lennon           123
1     George  Harrisson           456
2      Ringo      Starr           789

In [177]:
pb_df['full name'] = pb_df['first_name']+ pb_df['last_name']
pb_df

  first_name  last_name  phone_number        full name
0       John     Lennon           123       JohnLennon
1     George  Harrisson           456  GeorgeHarrisson
2      Ringo      Starr           789       RingoStarr

# Aligning, Reindexing and Renaming Labels

In [184]:
ser_6 = pd.Series(range(5), index=['a', 'b', 'c', 'd', 'e'])
sl_1 = ser_6[:4]
sl_2 = ser_6[2:]
print(ser_6)
print(sl_1)
print(sl_2)

a    0
b    1
c    2
d    3
e    4
dtype: int64
a    0
b    1
c    2
d    3
dtype: int64
c    2
d    3
e    4
dtype: int64

In [185]:
# Align both series by the union of their indexes
sl_1.align(sl_2)

(a    0.0
 b    1.0
 c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 a    NaN
 b    NaN
 c    2.0
 d    3.0
 e    4.0
 dtype: float64)

In [186]:
# Align by calling series
sl_1.align(sl_2, join='left')

(a    0
 b    1
 c    2
 d    3
 dtype: int64,
 a    NaN
 b    NaN
 c    2.0
 d    3.0
 dtype: float64)

In [187]:
# Use passed series indexes
sl_1.align(sl_2, join='right')

(c    2.0
 d    3.0
 e    NaN
 dtype: float64,
 c    2
 d    3
 e    4
 dtype: int64)

In [188]:
# Get where indexes intersect
sl_1.align(sl_2, join='inner')

(c    2
 d    3
 dtype: int64,
 c    2
 d    3
 dtype: int64)

In [189]:
# You can use align with DFs as well
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_6 = pd.DataFrame(arr_3, ['A', 'B'], ['C', 'D', 'E'])
arr_3 = np.random.randint(10, 50, size=(2, 3))
df_7 = pd.DataFrame(arr_3, ['B', 'C'], ['C', 'D', 'E'])
df_6
df_6.align(df_7)

(      C     D     E
 A  13.0  18.0  47.0
 B  34.0  13.0  26.0
 C   NaN   NaN   NaN,
       C     D     E
 A   NaN   NaN   NaN
 B  18.0  15.0  40.0
 C  37.0  38.0  33.0)

In [190]:
# reindex allows you to align data by index
ser_6.reindex(['c','b','a'])

c    2
b    1
a    0
dtype: int64

In [191]:
# Do the same with DFs
df_6.reindex(['B','A'])

    C   D   E
B  34  13  26
A  13  18  47

In [192]:
# Drop is very similar to reindex except it receives labels
# you don't want to include
df_6.drop(['A'], axis=0)

    C   D   E
B  34  13  26

In [193]:
df_6.drop(['D'], axis=1)

    C   E
A  13  47
B  34  26

In [194]:
# You can rename labels
df_6.rename(columns={'C': 'Men', 'D': 'Women', 'E': 'Pets'},
           index={'A': 1, 'B': 2})

   Men  Women  Pets
1   13     18    47
2   34     13    26

# MultiIndex

In [195]:
# Multi-level indexing allows you to store data on multiple
# dimensions
days = ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2']
meals = [1,2,3,1,2,3]

In [196]:
# zip pairs the days and meals arrays 
# Then we create a list of those paired tuples
hier_index = list(zip(days, meals))
print(hier_index)

[('Day 1', 1), ('Day 1', 2), ('Day 1', 3), ('Day 2', 1), ('Day 2', 2), ('Day 2', 3)]

In [197]:
# Converts list of tuples into each row and column
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('Day 1', 1),
            ('Day 1', 2),
            ('Day 1', 3),
            ('Day 2', 1),
            ('Day 2', 2),
            ('Day 2', 3)],
           )

In [198]:
# Generate random array representing calories eaten per meal
arr_5 = np.random.randint(500, 700, size=(6, 2))
df_9 = pd.DataFrame(arr_5, hier_index, ['M', 'F'])
print(df_9)

           M    F
Day 1 1  574  646
      2  659  549
      3  674  586
Day 2 1  548  647
      2  634  508
      3  663  596

In [199]:
# Grab the day 1 DF
df_9.loc['Day 1']

     M    F
1  574  646
2  659  549
3  674  586

In [200]:
# Grab 1st row as a series
df_9.loc['Day 1'].loc[1]

M    574
F    646
Name: 1, dtype: int64

In [201]:
# Grab calories eaten by the female on day 2 for the 2nd meal
df_9.loc['Day 2'].loc[2]['F']

508

In [202]:
# We can assign names to the Day and Meals Column
df_9.index.names = ['Day', 'Meal']
df_9

              M    F
Day   Meal
Day 1 1     574  646
      2     659  549
      3     674  586
Day 2 1     548  647
      2     634  508
      3     663  596

In [203]:
# Get a cross section
# This gets me the Day 2 DF
df_9.xs('Day 2')

        M    F
Meal
1     548  647
2     634  508
3     663  596

In [204]:
# Get calories for the 1st meal for both days by saying what
# meal index you want and the Meal column name
df_9.xs(1, level='Meal')

         M    F
Day
Day 1  574  646
Day 2  548  647

In [207]:
# Create a MultiIndex out of a DF using a pivot table
dict_6 = {'A':['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
         'B': [1,2,3,1,2,3],
         'C': ['M', 'F', 'M', 'F', 'M', 'F'],
         'D': [1,2,3,4,5,6]}
df_14 = pd.DataFrame(dict_6)
df_14

       A  B  C  D
0  Day 1  1  M  1
1  Day 1  2  F  2
2  Day 1  3  M  3
3  Day 2  1  F  4
4  Day 2  2  M  5
5  Day 2  3  F  6

In [208]:
# Designate the D column is the data
# Make A & B a multilevel index
# Define column names come from column C
# You will have NaNs where data was missing
df_14.pivot_table(values='D', index=['A','B'], columns=['C'])

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN

# Handling Missing Data

In [209]:
dict_4 = {'A': [1,2,np.nan], 'B': [4, np.nan, np.nan], 'C': [7.,8.,9.]}
df_10 = pd.DataFrame(dict_4)
print(df_10)

# Drop missing data from DF (Drops any row with missing values)
df_10.dropna()

# Drop all columns with any missing data
df_10.dropna(axis=1)

# Drop row unless it has at least 2 non-NaN values
df_10.dropna(thresh=2)

# Fill NaN values with 0
df_10.fillna(value=0.0)

# Fill A column with the mean of column
df_10['A'].fillna(value=df_10['A'].mean())

# Fill with previous value
df_10.fillna(method='ffill')

# Fill with next value (Only works if there is a next value)
df_10.fillna(method='bfill')

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0
2  NaN  NaN  9.0

     A    B    C
0  1.0  4.0  7.0
1  2.0  NaN  8.0
2  NaN  NaN  9.0